3A/SE465/Control-Flow.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-02-19 Mon 20:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Control Flow</title>
<meta name="author" content="Arnav Gupta" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Control Flow</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgbcf2602">1. Program Graphs</a>
<ul>
<li><a href="#org25f5dce">1.1. Control Flow Graphs</a>
<ul>
<li><a href="#org48e1123">1.1.1. The <code>if</code> Statement</a></li>
<li><a href="#org9c7c15a">1.1.2. <code>do</code>, <code>while</code>, and <code>for</code> Loops</a></li>
<li><a href="#org5939bc0">1.1.3. <code>case</code> Structure</a></li>
<li><a href="#orgbf420ef">1.1.4. <code>try-catch</code> Exceptions</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orge00fc55">2. Coverage</a>
<ul>
<li><a href="#org4e3aad5">2.1. Statement Coverage</a></li>
<li><a href="#org3364d59">2.2. Segment Coverage</a></li>
<li><a href="#org474af65">2.3. Branch Coverage</a></li>
<li><a href="#org19cf7b4">2.4. Condition Coverage</a></li>
<li><a href="#orgf292b2b">2.5. Condition/Decision Coverage</a></li>
<li><a href="#org6f91b59">2.6. Multple Condition Coverage</a></li>
<li><a href="#orgafde5fb">2.7. Modified Condition/Decision Coverage (MC/DC)</a></li>
<li><a href="#orgfbe1a19">2.8. Loop Coverage</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgbcf2602" class="outline-2">
<h2 id="orgbcf2602"><span class="section-number-2">1.</span> Program Graphs</h2>
<div class="outline-text-2" id="text-1">
<p>
Given a program written in an imperative programing language,
its program graph is a directed graph in which
</p>
<ul class="org-ul">
<li>nodes are statement fragments (or complete statements)</li>
<li>edges represent flow of control</li>
</ul>
</div>
<div id="outline-container-org25f5dce" class="outline-3">
<h3 id="org25f5dce"><span class="section-number-3">1.1.</span> Control Flow Graphs</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Models all executions of a method by describing control structures:
</p>
<ul class="org-ul">
<li>nodes are statements or sequences of statements (basic blocks)</li>
<li>edges are transfers of control
<ul class="org-ul">
<li>an edge \((s_{1}, s_{2})\) indicates that \(s_{1}\) may be
followed by \(s_{2}\) in an execution</li>
</ul></li>
</ul>

<p>
Basic block: sequence of statements such that if the first statement is executed
all statements will be (no branches)
</p>
<ul class="org-ul">
<li>intermediate statements not shown if there is \(\le 1\) exiting edge and \(\le 1\) entering edge</li>
<li>has one entry point and one exit point</li>
</ul>

<p>
Sometimes annotated with branch predicates and defs.
</p>
</div>
<div id="outline-container-org48e1123" class="outline-4">
<h4 id="org48e1123"><span class="section-number-4">1.1.1.</span> The <code>if</code> Statement</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
From source code to CFG there is an issue about branching:
</p>
<ul class="org-ul">
<li>in a CFG, nodes corresponding to branching should not contain any assignemnts</li>
<li><code>return</code> nodes must be distinct</li>
</ul>

<p>
Short circuiting conditions must be shown with separate branches for each condition.
</p>
</div>
</div>
<div id="outline-container-org9c7c15a" class="outline-4">
<h4 id="org9c7c15a"><span class="section-number-4">1.1.2.</span> <code>do</code>, <code>while</code>, and <code>for</code> Loops</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
Can have:
</p>
<ul class="org-ul">
<li>dummy nodes for condition checking or initializing loops</li>
<li>nodes to implicitly increment loop</li>
</ul>

<p>
<code>do</code> loops will branch at last step, <code>while</code> loops branch at first
</p>
</div>
</div>
<div id="outline-container-org5939bc0" class="outline-4">
<h4 id="org5939bc0"><span class="section-number-4">1.1.3.</span> <code>case</code> Structure</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
Cases without breaks fall through to the next case
</p>
</div>
</div>
<div id="outline-container-orgbf420ef" class="outline-4">
<h4 id="orgbf420ef"><span class="section-number-4">1.1.4.</span> <code>try-catch</code> Exceptions</h4>
<div class="outline-text-4" id="text-1-1-4">
<p>
Both <code>throw</code> and catching each type of exception must be shown separately.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orge00fc55" class="outline-2">
<h2 id="orge00fc55"><span class="section-number-2">2.</span> Coverage</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org4e3aad5" class="outline-3">
<h3 id="org4e3aad5"><span class="section-number-3">2.1.</span> Statement Coverage</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Has the following characteristics:
</p>
<ul class="org-ul">
<li>achieved when all statements in a method have been executing at least once.
<ul class="org-ul">
<li>faults cannot be discovered if the parts containing them are not executed</li>
</ul></li>
<li>equivalent to covering all nodes in a CFG</li>
<li>executing a statement is a weak guarantee of correctness, but easy to achieve</li>
</ul>
<p>
\[
        \text{Statement Coverage} = \frac{\text{\# of executed statements}}{\text{total \# of statements}}
\]
</p>

<p>
Most used in industry with coverage target at 80-90%.
</p>

<p>
Problems include:
</p>
<ul class="org-ul">
<li>predicate may be tested for only one value</li>
<li>loop bodies may be iterated only once</li>
<li>not all branches (cases) are necessarily covered</li>
</ul>
</div>
</div>
<div id="outline-container-org3364d59" class="outline-3">
<h3 id="org3364d59"><span class="section-number-3">2.2.</span> Segment Coverage</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Counts segments (basic blocks) rather than statements
</p>
<ul class="org-ul">
<li>can produce drastically different numbers since it does not account for # of statements per segment</li>
</ul>
</div>
</div>
<div id="outline-container-org474af65" class="outline-3">
<h3 id="org474af65"><span class="section-number-3">2.3.</span> Branch Coverage</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Has the following characteristics:
</p>
<ul class="org-ul">
<li>achieved when every branch from a node is executed at least once</li>
<li>at least one true and one false evaluation for each predicate</li>
<li>can be achieved with \(D+1\) paths in a CFG with \(D\) 2-way branching nodes and no loops
<ul class="org-ul">
<li>less if there are loops</li>
</ul></li>
</ul>
<p>
\[
        \text{Branch Coverage} = \frac{\text{\# of executed branches}}{\text{total \# of branches}}
\]
</p>

<p>
Problems include:
</p>
<ul class="org-ul">
<li>short-circuit evaluation means that many predicates might not be evaluated</li>
<li>compound predicate treated as a single statement
<ul class="org-ul">
<li>if \(n\) clauses, \(2^{n}\) combinations but only 2 tested</li>
</ul></li>
<li>only a subset of all entry-exit paths is tested</li>
</ul>
</div>
</div>
<div id="outline-container-org19cf7b4" class="outline-3">
<h3 id="org19cf7b4"><span class="section-number-3">2.4.</span> Condition Coverage</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Has the following characteristics:
</p>
<ul class="org-ul">
<li>condition coverage reports the true or false outcome of each condition</li>
<li>measures the conditions independetly of each other</li>
<li>can fail to consider short-circuit</li>
</ul>
<p>
\[
        \text{Condition Coverage} =
        \frac{\text{\# of conditions that are both T and F}}{\text{total \# of conditions}}
\]
</p>
</div>
</div>
<div id="outline-container-orgf292b2b" class="outline-3">
<h3 id="orgf292b2b"><span class="section-number-3">2.5.</span> Condition/Decision Coverage</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Also called branch and condition coverage,
it is computed by considering both branch and condition coverage measures.
</p>
</div>
</div>
<div id="outline-container-org6f91b59" class="outline-3">
<h3 id="org6f91b59"><span class="section-number-3">2.6.</span> Multple Condition Coverage</h3>
<div class="outline-text-3" id="text-2-6">
<p>
All combinations of condition constituents in decisions are considered when calculating coverage.
</p>
<ul class="org-ul">
<li>also implies condition and branch coverage</li>
</ul>
</div>
</div>
<div id="outline-container-orgafde5fb" class="outline-3">
<h3 id="orgafde5fb"><span class="section-number-3">2.7.</span> Modified Condition/Decision Coverage (MC/DC)</h3>
<div class="outline-text-3" id="text-2-7">
<p>
<b>Key idea</b>: test important combinations of conditions and limiting testing costs
</p>
<ul class="org-ul">
<li>extend branch and decision coverage with the requirement that each condition should affect
the decision outcome independetly</li>
<li>in other words, each condition should be evaluated one time to true and one time to false,
and this with affecting the decision&rsquo;s outcome</li>
</ul>
</div>
</div>
<div id="outline-container-orgfbe1a19" class="outline-3">
<h3 id="orgfbe1a19"><span class="section-number-3">2.8.</span> Loop Coverage</h3>
<div class="outline-text-3" id="text-2-8">
<p>
Loops are highly fault-prone
</p>
<ul class="org-ul">
<li>every loop involves a decision to traverse the loop or not</li>
<li>can do boundary value analysis on the index variable</li>
</ul>

<p>
Has the following characteristics:
</p>
<ul class="org-ul">
<li>minimal coverage should execute the loop body 0, 1, and 2+ times</li>
<li>single loop should have more extensive coverage with setting loop control variable to:
<ul class="org-ul">
<li>min - 1, min, min + 1</li>
<li>typical</li>
<li>max - 1, max, max + 1</li>
</ul></li>
<li>for nested loop, start at the innermost loop
<ul class="org-ul">
<li>set all outer loops to min value</li>
<li>set all other loops to typical values</li>
<li>test cases for a single loop for the innermost loop</li>
<li>move up in nested loop level</li>
<li>if outermost loop done, do cases for single loop for all loops
in the nest simultanously</li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Arnav Gupta</p>
<p class="date">Created: 2024-02-19 Mon 20:07</p>
</div>
</body>
</html>
